# 4.6 Combining & Exporting Data

## Table of contents 

### 01. Importing Libraries
### 02. Importing Data
### 03. Checking the shape of dataframes 
### 04. Merging the dataframes 
### 05. Exporting the new dataframe

# 01. Importing Libraries

In [1]:
#Import the pandas, NumPy, and os libraries.
import pandas as pd
import numpy as np
import os

# 02. Importing Data

In [5]:
#Creating a path
path = r'C:\Users\canam\Achievement 4\Instacart Basket Analysis'

In [39]:
#importing orders_products_combined pkl
df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [41]:
#checking to see that the shape of imported dataframe is the same as the exported one.
df_orders_products_combined.shape

(32434489, 11)

In [43]:
#checking the output
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,1,196,1,0,both
1,2539329,1,1,2,8,NaN,1,14084,2,0,both
2,2539329,1,1,2,8,NaN,1,12427,3,0,both
3,2539329,1,1,2,8,NaN,1,26088,4,0,both
4,2539329,1,1,2,8,NaN,1,26405,5,0,both

In [47]:
#dropping the _merge column since we are going to be confirming the results of the next merge 
df_orders_products_combined = df_orders_products_combined.drop(columns = ['_merge'])

In [51]:
#checking to see that the _merge column has been dropped
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,1,196,1,0
1,2539329,1,1,2,8,NaN,1,14084,2,0
2,2539329,1,1,2,8,NaN,1,12427,3,0
3,2539329,1,1,2,8,NaN,1,26088,4,0
4,2539329,1,1,2,8,NaN,1,26405,5,0

In [17]:
#importing wrangled, cleaned, and deduped products data set 
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [21]:
#checking the output
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [25]:
#dropping the unnamed column
df_prods.drop(df_prods.columns[df_prods.columns.str.contains('unnamed',case = False)],axis = 1, inplace = True)

In [27]:
#checking to see if unnamed column has been dropped 
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

# 03. Checking the shape of the dataframes

In [55]:
#Checking the shape of orders_products_combined
df_orders_products_combined.shape

(32434489, 10)

In [31]:
#checking the shape of df_prods
df_prods.shape

(49672, 5)

# 04. Merging the dataframes

An suitable way to combine the two data frames is to merge them using 'product' id as the key since this is a column they both have.  Since this project only works with data sets that have a full merge rate, we can use the default option of inner join.

In [57]:
#merging the data frames
df_ords_prods_merge = df_prods.merge(df_orders_products_combined, on = 'product_id', indicator = True)

In [59]:
#checking the output
df_ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order,add_to_cart_order,reordered,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,3.0,0,5,0,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,20.0,0,1,1,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,6.0,0,20,0,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,NaN,1,10,0,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,9.0,0,11,1,both

In [62]:
#checking the new dataframe's shape
df_ords_prods_merge.shape

(32404859, 15)

In [64]:
#checking the merge flag frequency
df_ords_prods_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

Since we used the default 'inner join' to merge the two dataframes, we see that every row has a value of 'both' in the merge flag.

# 05. Exporting the new dataframe as ords_prods_merge

In [66]:
df_ords_prods_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge.pkl'))